<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1" />
<title>INFORMATX08</title>
<LINK rel="shortcut icono" href="Black White Minimalist SImple Monogram Typography Logo (1).png" />

</head>

<body bgcolor="#FFFFFF" text="#000000">
<a href="#inicio">
<h1 align="center"><font color="#000000" face="Algerian"><img src="Black White Minimalist SImple Monogram Typography Logo (1).png" width="68" height="66" />INFORMATI</font color><font color="#FF0000">X</font color></h1>
<HR /> 
 

</tr>
</table>
<div align="center"><img src="CENACAP.png" width="276" height="51" />
</div>
<p align="center">&nbsp;</p>
<p align="center">&nbsp;</p>
<p align="center">&nbsp;</p>
<div align="center"><a href="#1"><a href="#2"> ANTIVIRUS /&nbsp;&nbsp;&nbsp;&nbsp;   </a>
    <a href="#3">VACUNAS&nbsp;/&nbsp;&nbsp;&nbsp;   </a>
    <a href="#4"> ANTIMALWARE  &nbsp;&nbsp;&nbsp;/&nbsp;&nbsp;   </a>
    <a href="#5"> ANTISPYWAERE &nbsp;&nbsp;&nbsp;</a><a href="5">&nbsp;&nbsp;/&nbsp;&nbsp;&nbsp;
    </a>
  <a href="#7">RANSONWARE   </a></div>
<p align="center">&nbsp;</p>
<p align="center">&nbsp;</p>
<p align="center">&nbsp;</p>
<H3 align="center">
  <a name="1"></a>VIRUS INFORMATICO </H3>
<H3>&nbsp;</H3>
<h2>Tipos de virus inform&aacute;ticos y qu&eacute; hacen</h2>
<p>Los tipos de virus inform&aacute;ticos pueden clasificarse seg&uacute;n el ataque para el que est&aacute;n programados o por las<strong>&nbsp;caracter&iacute;sticas que los definen.</strong></p>
<h3>Tipos de virus inform&aacute;ticos en funci&oacute;n del tipo de ataque</h3>
<p>Los virus dise&ntilde;ados para realizar los conocidos como<strong>&nbsp;ciberataques</strong>, son acciones dirigidas a desestabilizar sistemas de informaci&oacute;n. Algunos ejemplos son:</p>
<ul>
  <li><em><strong>Adware</strong></em>. Tambi&eacute;n conocido como software de publicidad, muestra anuncios basados en visitas o b&uacute;squedas. Adem&aacute;s, reduce la capacidad de c&oacute;mputo del equipo.</li>
  <li><em><strong>Spybot</strong></em>. El tipo de virus inform&aacute;tico spyware recopila informaci&oacute;n de un dispositivo para transmitirlo a una entidad externa sin el consentimiento del usuario, posiblemente para extorsionarlo.</li>
  <li><em><strong>Malware.</strong></em>&nbsp;Altera el funcionamiento normal del equipo al destruir o corromper el sistema operativo o programas. Puede propagarse mediante c&oacute;digos por correo electr&oacute;nico.</li>
  <li><em><strong>Ransomware.</strong></em>&nbsp;Secuestra la informaci&oacute;n del equipo mediante cifrado para que el usuario no pueda acceder a ella y, de este modo, solicitarle un rescate econ&oacute;mico. De lo contrario, la informaci&oacute;n podr&iacute;a destruirse o publicarse en internet.</li>
  <li><em><strong>Virus inform&aacute;tico o gusano.</strong></em>&nbsp;Se caracteriza por multiplicarse mediante el env&iacute;o masivo de copias de s&iacute; mismo por correo electr&oacute;nico u otras v&iacute;as de contacto. Suele infectar los equipos que se conectan a redes p&uacute;blicas.</li>
  <li><em><strong>Troyano.&nbsp;</strong></em>Bajo la apariencia de un programa, un documento o un juego leg&iacute;timo, entra en el sistema porque el usuario lo instala. Al ejecutarlo, accede a toda la informaci&oacute;n del equipo.</li>
</ul>
<h3>Tipos de virus inform&aacute;ticos en funci&oacute;n de sus caracter&iacute;sticas</h3>
<p>Aunque existen muchas clases, resumimos a continuaci&oacute;n los&nbsp;<strong>principales tipos de virus inform&aacute;ticos&nbsp;</strong>seg&uacute;n sus particularidades:</p>
<ul>
  <li><strong>Virus residentes</strong>. Infectan cualquier archivo que se copie, abra, cierre o renombre.</li>
  <li><strong>Virus de acci&oacute;n directa</strong>. Se replican y act&uacute;an cuando se cumple una condici&oacute;n espec&iacute;fica para su ejecuci&oacute;n.</li>
  <li><strong>Virus de sobreescritura</strong>. Borran la informaci&oacute;n de los ficheros afectados para sustituir el contenido.</li>
  <li><strong>Virus de sector de arranque.</strong>&nbsp;Impiden que el sistema operativo se ejecute.</li>
  <li><strong>Virus de macro</strong>. Infectan archivos que utilizan ciertos programas con macros, como Word o Excel.</li>
  <li><strong>Virus polim&oacute;rficos</strong>. Se codifican de forma diferente cada vez que infectan un sistema dificultando su detecci&oacute;n.</li>
  <li><strong>Virus FAT.</strong>&nbsp;Impiden el acceso a ciertas secciones del disco duro donde se guardan archivos importantes.</li>
  <li><strong>Virus de secuencias de comandos web</strong>. Aprovechan el c&oacute;digo de las p&aacute;ginas para producir determinadas acciones indeseab</li>
</ul>
<H3>&nbsp; </H3>
<p>ALGUNOS TIPOS DE VIRUS INFORMATICOS SON :</p>
<table width="895" border="1">
  <tr>
    <td width="90" height="37"><strong>Virus residentes</strong></td>
    <td width="776">&nbsp;Estos virus se instalan en el ordenador y se ejecutan cada vez que se inicia el sistema.</td>
    <td width="7">&nbsp;</td>
  </tr>
  <tr>
    <td><strong>Gusanos</strong></td>
    <td>Estos virus se propagan a trav&eacute;s de redes y medios de almacenamiento, como unidades flash USB y discos duros externos.</td>
    <td>&nbsp;</td>
    
  </tr>
  <tr>
    <td><strong>Troyanos</strong></td>
    
    <td>&nbsp;Estos virus se disfrazan de programas leg&iacute;timos para enga&ntilde;ar a los usuarios para que los instalen.</td>
    <td>&nbsp;</td>
  </tr>
  <tr>
    <td height="42"><strong>Virus de macro</strong></td>
    <td>Estos virus se ejecutan en aplicaciones de oficina, como Microsoft Office. V </td>
    <td>&nbsp;</td>
   
  </tr>
</table>
<p>&nbsp;</p>
<p data-sourcepos="1:1-1:222">Los virus inform&aacute;ticos son programas maliciosos que se propagan de un ordenador a otro, infectando los archivos y el software. Pueden causar da&ntilde;os a los datos, el rendimiento del ordenador y la seguridad de la informaci&oacute;n.Hay muchos tipos diferentes de virus inform&aacute;ticos, que se pueden clasificar de diferentes maneras. Una forma de clasificarlos es seg&uacute;n su m&eacute;todo de propagaci&oacute;n:<a href="https://co.norton.com/blog/malware/what-is-a-computer-virus"target="_blank">si tiene alguna duda puede vistar</a></p>
<p data-sourcepos="1:1-1:222">&nbsp;</p>
<h3><p data-sourcepos="9:1-9:69">Otra forma de clasificar los virus inform&aacute;ticos es seg&uacute;n su objetivo:</p></H3>
<ul data-sourcepos="11:1-14:0">
  <li data-sourcepos="11:1-11:76"><strong>Da&ntilde;os:</strong>&nbsp;Estos virus est&aacute;n dise&ntilde;ados para da&ntilde;ar los datos o el software.</li>
  <li data-sourcepos="12:1-12:139"><strong>Roba informaci&oacute;n:</strong>&nbsp;Estos virus est&aacute;n dise&ntilde;ados para robar informaci&oacute;n confidencial, como contrase&ntilde;as o n&uacute;meros de tarjetas de cr&eacute;dito.</li>
  <li data-sourcepos="13:1-14:0"><strong>Control:</strong>&nbsp;Estos virus est&aacute;n dise&ntilde;ados para tomar el control de un ordenador o red.</li>
</ul>
<p data-sourcepos="15:1-15:57">Algunos tipos espec&iacute;ficos de virus inform&aacute;ticos incluyen:.</p>
<ul data-sourcepos="17:1-21:0"><li data-sourcepos="18:1-18:62"><strong>Virus de script:</strong>&nbsp;Estos virus se ejecutan en scripts web.</li>
  <li data-sourcepos="19:1-19:140"><strong>Virus polim&oacute;rficos:</strong>&nbsp;Estos virus cambian su c&oacute;digo cada vez que se propagan, lo que dificulta su detecci&oacute;n por los programas antivirus.</li>
  <li data-sourcepos="20:1-21:0"><strong>Virus de cifrado:</strong>&nbsp;Estos virus encriptan los datos del ordenador y exigen un rescate para descifrarlos.</li>
</ul>
<p data-sourcepos="22:1-22:161">Para protegerse de los virus inform&aacute;ticos, es importante tener instalado un software antivirus actualizado y utilizar pr&aacute;cticas de seguridad inform&aacute;tica seguras.</p>
<p data-sourcepos="24:1-24:63"><strong>Algunos consejos para protegerse de los virus inform&aacute;ticos:</strong></p>
<ul data-sourcepos="26:1-31:0">
  <li data-sourcepos="26:1-26:59"><strong>Instale y mantenga actualizado un software antivirus.</strong></li>
  <li data-sourcepos="27:1-27:85"><strong>Evite abrir archivos adjuntos de correo electr&oacute;nico de remitentes desconocidos.</strong></li>
  <li data-sourcepos="28:1-28:89"><strong>No haga clic en enlaces de correo electr&oacute;nico o sitios web de fuentes desconocidas.</strong></li>
  <li data-sourcepos="29:1-29:60"><strong>Mantenga su sistema operativo y software actualizados.</strong></li>
  <li data-sourcepos="30:1-31:0"><strong>Realice copias de seguridad de sus datos con regularidad.</strong></li>
</ul>
<p data-sourcepos="32:1-32:101">Al seguir estos consejos, puede ayudar a proteger su ordenador y sus datos de los virus inform&aacute;ticos.</p>
<p align="center"><img src="J.jpg" width="763" height="445" /></p>
<h2>El programa Creeper</h2>
<p>Como se&ntilde;al&oacute; Discovery, el programa Creeper, a menudo considerado el primer virus, fue creado en 1971 por Bob Thomas de BBN. En realidad, Creeper fue dise&ntilde;ado como una prueba de seguridad para comprobar si era posible crear un programa capaz de replicarse. De cierta manera, lo fue. Con cada disco duro nuevo infectado, Creeper trataba de eliminarse a s&iacute; mismo del equipo anfitri&oacute;n anterior. Creeper no ten&iacute;a una intenci&oacute;n maliciosa y solo mostraba un mensaje simple: &quot;I'M THE CREEPER. CATCH ME IF YOU CAN!&quot; (Soy Creeper, &iexcl;atr&aacute;pame si puedes!).</p>
<h2>El virus Rabbit</h2>
<p>Seg&uacute;n&nbsp;<a href="http://infocarnivore.com/the-very-first-viruses-creeper-wabbit-and-brain/" target="_blank">InfoCarnivore</a>, el virus Rabbit (o Wabbit), que fue desarrollado en 1974, s&iacute; ten&iacute;a una intenci&oacute;n maliciosa y era capaz de replicarse. Despu&eacute;s de infectar una computadora, realizaba m&uacute;ltiples copias de s&iacute; mismo, lo que causaba una reducci&oacute;n considerable en el rendimiento del sistema hasta colapsarlo. La velocidad de replicaci&oacute;n fue la caracter&iacute;stica que determin&oacute; el t&eacute;rmino &quot;virus&quot;.</p>
<h2>El primer troyano</h2>
<p>El primer troyano, llamado ANIMAL, (aunque existe cierto&nbsp;<a href="https://securelist.com/threats/1970s/" target="_blank">desacuerdo</a>&nbsp;sobre si se trat&oacute; de un troyano u otro virus solamente) fue desarrollado por el programador inform&aacute;tico John Walker en 1975, seg&uacute;n inform&oacute;&nbsp;<a href="http://www.fourmilab.ch/documents/univac/animal.html" target="_blank">Fourmilab</a>. En esa &eacute;poca, los &quot;programas de animales&quot;, que trataban de adivinar en qu&eacute; animal estaba pensando el usuario con un juego de 20 preguntas, eran sumamente populares. La versi&oacute;n que cre&oacute; Walker se hizo muy popular y el env&iacute;o a sus amigos implicaba la grabaci&oacute;n y la transmisi&oacute;n de cintas magn&eacute;ticas. Para facilitar las cosas, Walker cre&oacute; PREVADE , que se instalaba junto con ANIMAL. Mientras jugaba al juego, PREVADE examinaba todos los directorios inform&aacute;ticos disponibles para el usuario y realizaba una copia de ANIMAL en cualquier directorio donde no estuviera presente. La intenci&oacute;n no era maliciosa, pero ANIMAL y PREVADE reflejan la definici&oacute;n de un troyano, ya que oculto dentro de ANIMAL hab&iacute;a otro programa que ejecutaba acciones sin la aprobaci&oacute;n del usuario.</p>
<h2>El virus de sector de arranque Brain</h2>
<p>Brain, el primer virus creado para PC, comenz&oacute; a infectar disquetes de 5,2&quot; el a&ntilde;o 1986. Seg&uacute;n el informe de&nbsp;<a href="https://securelist.com/threats/1980s/" target="_blank">Securelist</a>, este virus se atribuye a los hermanos Basit y Amjad Farooq Alvi, que regentaban una tienda inform&aacute;tica en Pakist&aacute;n. Cansados de que los clientes realizaran copias ilegales de su software, desarrollaron Brain, un programa que reemplazaba el sector de arranque de un disquete por un virus. El virus, el primero de tipo invisible, conten&iacute;a un mensaje de derechos de autor oculto, pero en realidad no da&ntilde;aba ning&uacute;n dato.</p>
<h2>El virus LoveLetter</h2>
<p>La introducci&oacute;n de redes de banda ancha confiables y veloces a principios del siglo XXI modific&oacute; la manera en que se transmit&iacute;a el malware. Este dej&oacute; de estar confinado a disquetes o redes empresariales y pod&iacute;a propagarse con gran rapidez a trav&eacute;s de correo electr&oacute;nico, sitios web populares o, incluso, directamente por Internet. Como resultado, comenz&oacute; a tomar forma lo que se conoce como malware moderno. El panorama de amenazas se convirti&oacute; en un &aacute;mbito mixto donde conviv&iacute;an virus, gusanos y troyanos, de ah&iacute; el uso del t&eacute;rmino gen&eacute;rico &quot;malware&quot; para referirse al software malicioso. Una de las epidemias m&aacute;s graves de esta nueva era fue LoveLetter, que apareci&oacute; el 4 de mayo de 2000.</p>
<p>Como comenta&nbsp;<a href="https://securelist.com/threats/2001/" target="_blank">Securelist</a>, esta sigui&oacute; el patr&oacute;n de los primeros virus dirigidos al correo electr&oacute;nico de la historia; pero, a diferencia de los macrovirus que dominaban el panorama de amenazas desde 1995, este no adoptaba la forma de un documento de Word infectado, sino que se presentaba en forma de archivo VBS. Este virus era simple y directo, y como los usuarios todav&iacute;a no hab&iacute;an aprendido a desconfiar de los correos electr&oacute;nicos no solicitados, funcion&oacute;. La l&iacute;nea de asunto era &quot;I Love You&quot; (Te amo) y el correo electr&oacute;nico conten&iacute;a un archivo adjunto, &quot;LOVE-LETTER-FOR-YOU-TXT.vbs&quot;. El creador de ILOVEYOU, Onel de Guzm&aacute;n, dise&ntilde;&oacute; este gusano para que sobrescribiera archivos existentes y los reemplazara por copias de s&iacute; mismo, que luego se usaban para transmitir el gusano a todos los contactos de correo electr&oacute;nico de las v&iacute;ctimas. Como el mensaje a menudo llegaba a nuevas v&iacute;ctimas procedente de alguien conocido, era m&aacute;s probable que lo abrieran, convirtiendo a ILOVEYOU en una prueba de concepto de la eficacia de la ingenier&iacute;a social.</p>
<h2>El virus Code Red</h2>
<p>El gusano Code Red era un gusano &quot;sin archivos&quot;, es decir, solo exist&iacute;a en la memoria y no intentaba infectar archivos en el sistema. Aprovechando una falla en el Servidor de informaci&oacute;n de Internet de Microsoft, este gusano de r&aacute;pida replicaci&oacute;n caus&oacute; estragos despu&eacute;s de manipular los protocolos que permit&iacute;an a las computadoras comunicarse y se propag&oacute; globalmente en cuesti&oacute;n de horas. A continuaci&oacute;n, como se inform&oacute; en&nbsp;<a href="http://www.scientificamerican.com/article/code-red-worm-assault-on/" target="_blank">Scientific American</a>, los equipos comprometidos se utilizaron para lanzar un ataque de denegaci&oacute;n de servicio distribuido en el sitio web Whitehouse.gov.</p>
<h2>Heartbleed</h2>
<p>Heartbleed, uno de los virus principales m&aacute;s recientes, surgi&oacute; en 2014 y puso en riesgo servidores en toda la Internet. Heartbleed, a diferencia de los virus o gusanos, tiene su origen en una vulnerabilidad de OpenSSL, una biblioteca criptogr&aacute;fica de c&oacute;digo abierto y prop&oacute;sito general que utilizan empresas de todo el mundo. Peri&oacute;dicamente, OpenSSL env&iacute;a &quot;pulsaciones&quot; para comprobar que los endpoints seguros sigan conectados. Los usuarios pueden enviar a OpenSSL una cantidad espec&iacute;fica de datos y solicitar la devoluci&oacute;n de la misma cantidad; por ejemplo, un byte. Si los usuarios afirman que est&aacute;n enviando el m&aacute;ximo permitido, 64 kilobytes, pero solo env&iacute;an un byte, el servidor responde con los &uacute;ltimos 64 kilobytes de datos almacenados en la RAM &mdash;observa el experto en seguridad&nbsp;<a href="https://www.schneier.com/blog/archives/2014/04/heartbleed.html" target="_blank">Bruce Schneier</a>&mdash; que pueden incluir de todo, desde nombres de usuario hasta contrase&ntilde;as y claves de cifrado de seguridad.</p>
<hr />
<p>&nbsp;</p>
<p>&nbsp;</p>
<h1>
 <a name="2"></a> <p align="center">ANTIVIRUS </p>
</h1>
<h2 id="">&iquest;Qu&eacute; es un antivirus inform&aacute;tico?</h2>
<p>Los antivirus inform&aacute;ticos son piezas de&nbsp;<a href="https://concepto.de/software/">software</a>&nbsp;de aplicaci&oacute;n cuyo&nbsp;<a href="https://concepto.de/objetivo/">objetivo</a>&nbsp;es&nbsp;<strong>detectar y eliminar de un sistema computarizado los virus inform&aacute;ticos</strong>. Es decir, se trata de un&nbsp;<a href="https://concepto.de/programa-informatico/">programa</a>&nbsp;que busca poner remedio a los da&ntilde;os causados por estas formas invasivas de software, cuya presencia en el sistema no suele ser detectable sino hasta que se evidencian sus s&iacute;ntomas, tal y como los virus biologicos </p>
<br />
<p data-sourcepos="1:1-1:226">Antivirus software, also known as anti-malware, is a computer program used to prevent, detect, and remove malware. Antivirus software was originally developed to detect and remove computer viruses, hence the name.</p>
<p data-sourcepos="3:1-3:208">Antivirus software works by scanning your computer for known malware signatures and suspicious activity. When it finds malware, the antivirus software can remove it, quarantine it, or prevent it from running.</p>
<p data-sourcepos="5:1-5:144">Antivirus software is an important part of any computer security system. It can help protect your computer from a variety of threats, including:</p>
<ul data-sourcepos="7:1-13:0">
  <li data-sourcepos="7:1-7:9">Viruses</li>
  <li data-sourcepos="8:1-8:7">Worms</li>
  <li data-sourcepos="9:1-9:15">Trojan horses</li>
  <li data-sourcepos="10:1-10:9">Spyware</li>
  <li data-sourcepos="11:1-11:8">Adware</li>
  <li data-sourcepos="12:1-13:0">Ransomware</li>
</ul>
<p data-sourcepos="14:1-14:124">There are many different antivirus software programs available, both free and paid. Some popular antivirus programs include:</p>
<ul data-sourcepos="16:1-22:0">
  <li data-sourcepos="16:1-16:7">Avast</li>
  <li data-sourcepos="17:1-17:5">AVG</li>
  <li data-sourcepos="18:1-18:13">Bitdefender</li>
  <li data-sourcepos="19:1-19:11">Kaspersky</li>
  <li data-sourcepos="20:1-20:8">Norton</li>
  <li data-sourcepos="21:1-22:0">ESET</li>
</ul>
<p data-sourcepos="23:1-23:95">When choosing an antivirus software program, it is important to consider the following factors:</p>
<ul data-sourcepos="25:1-29:0">
  <li data-sourcepos="25:1-25:92"><strong>Price:</strong>&nbsp;Antivirus software programs can range in price from free to over $100 per year.</li>
  <li data-sourcepos="26:1-26:155"><strong>Features:</strong>&nbsp;Some antivirus software programs offer more features than others, such as real-time protection, parental controls, and password protection.</li>
  <li data-sourcepos="27:1-27:189"><strong>Performance:</strong>&nbsp;Antivirus software programs can slow down your computer, so it is important to choose a program that is lightweight and does not have a significant impact on performance.</li>
  <li data-sourcepos="28:1-29:0"><strong>Compatibility:</strong>&nbsp;Make sure that the antivirus software program you choose is compatible with your operating system and other software.</li>
</ul>
<p data-sourcepos="30:1-30:243">Once you have chosen an antivirus software program, you should install it on all of your computers, including laptops, tablets, and smartphones. You should also keep your antivirus software program up to date with the latest virus definitions.</p>
<p data-sourcepos="32:1-32:134">In addition to using antivirus software, there are a number of other things you can do to protect your computer from viruses, such as:</p>
<ul data-sourcepos="34:1-38:0">
  <li data-sourcepos="34:1-34:134"><strong>Be careful about what you open:</strong>&nbsp;Do not open email attachments or download files from websites unless you are sure they are safe.</li>
  <li data-sourcepos="35:1-35:181"><strong>Keep your software up to date:</strong>&nbsp;Software developers often release updates that patch security vulnerabilities. Make sure to install these updates as soon as they are available.</li>
  <li data-sourcepos="36:1-36:168"><strong>Use strong passwords and enable two-factor authentication:</strong>&nbsp;Strong passwords and two-factor authentication can help protect your online accounts from being hacked.</li>
  <li data-sourcepos="37:1-38:0"><strong>Be aware of phishing scams:</strong>&nbsp;Phishing scams are emails or websites that are designed to trick you into revealing sensitive information, such as your passwords or credit card numbers. Be suspicious of any email or website that asks you for personal information.</li>
</ul>
<p data-sourcepos="39:1-39:105">By following these tips, you can help protect your computer and your data from viruses and other malware.</p>
<h1>&nbsp;</h1>
<h2 id="">&iquest;Para qu&eacute; sirven los antivirus inform&aacute;ticos?</h2>
<p>En la actualidad, los antivirus sirven para m&aacute;s que simplemente&nbsp;<strong>escanear y desinfectar una m&aacute;quina que ha contra&iacute;do un virus inform&aacute;tico</strong>. Por lo general ofrecen servicios de monitoreo activo, para impedir el acceso total de un documento infectado al sistema, bloquear&nbsp;<a href="https://concepto.de/pagina-web/">p&aacute;ginas web</a>&nbsp;inseguras y eliminar archivos riesgosos apenas ingresen al&nbsp;<a href="https://concepto.de/computador/">computar</a>. A esto suele llam&aacute;rsele protecci&oacute;n activa.</p>
<p>Por otro lado, los antivirus inform&aacute;ticos lidian tambi&eacute;n con otras piezas de software no deseado, como el&nbsp;<em>spyware</em>,&nbsp;<em>malware</em>&nbsp;o&nbsp;<em>rootkits</em>, e incluso de intentos de hackeo. Para ello posee un&nbsp;<em>firewall</em>&nbsp;(software de bloqueo de conexiones remotas) y una&nbsp;<a href="https://concepto.de/base-de-datos/">base de datos</a>&nbsp;de definiciones de virus, que es una suerte de enciclopedia de los virus ya conocidos</p>
<p align="center"><img src="IO.jpg" width="380" height="303" /></p>
<h2 id="">Tipos de antivirus inform&aacute;ticos</h2>
<p>Puede identificarse varios tipos de antivirus inform&aacute;tico, de acuerdo a su funcionamiento:</p>
<ul>
  <li><strong>Antivirus de identificaci&oacute;n.</strong>&nbsp;Aquellos que rastrean secuencias activas asociadas a determinados virus, pero no son muy efectivos a la hora de lidiar con el software indeseado. Tienen la virtud de ser muy ligeros, algunos se ejecutan desde la&nbsp;<a href="https://concepto.de/red-2/">red</a>.</li>
  <li><strong>Antivirus descontaminadores.</strong>&nbsp;Por lo general instalados en el sistema como cualquier otro&nbsp;<a href="https://concepto.de/software-de-aplicacion/">software de aplicaci&oacute;n</a>, estos programas pueden activarse a voluntad para revisar el contenido completo del computador en busca de virus. De haberlos, entonces, se procede a la desinfecci&oacute;n y, de no ser posible, a la cuarentena o el borrado.</li>
  <li><strong>Antivirus de protecci&oacute;n a tiempo real.</strong>&nbsp;Aquellos que brindan protecci&oacute;n constante al sistema, sin necesidad de llevar a cabo una revisi&oacute;n exhaustiva, sino revisando todos los archivos y conexiones entrantes y salientes. Estos antivirus suelen estar combinados con funciones descontaminadoras.</li>
</ul>


<p>RECOMENDACIONES PARA UNA LIEMPIEZA DE SU EQUIPO: </p>

<p><a href="https://co.norton.com/blog/malware/what-is-a-computer-virus"target="_blank">descargue </a>&nbsp;<strong>instalar CCleaner en tu ordenador</strong>&nbsp;para limpiar tu equipo de archivos innecesarios y acelerar el funcionamiento, presta atenci&oacute;n cuando lo descargues porque el instalador tiene integrado el&nbsp;<strong>software de seguridad Avast Antivirus.</strong> </p>
<p><a href="https://co.norton.com/blog/malware/what-is-a-computer-virus" target="_blank">e aqui : CCleaner</a></p>
<p>Si vas a</p>
<p><a href="https://www.eicar.org/download-anti-malware-testfile/"target="_blank">descargue aqui : eicar</a></p>
<p>para probar la respuesta de los&nbsp;<a href="https://es.wikipedia.org/wiki/Programa_inform%C3%A1tico" title="Programa inform&aacute;tico">programas</a>&nbsp;<a href="https://es.wikipedia.org/wiki/Antivirus" title="Antivirus">antivirus</a>&nbsp;en el equipo. La raz&oacute;n detr&aacute;s de esto es permitir a las personas, empresas y programadores de antivirus, probar su software sin tener que utilizar un verdadero&nbsp;<a href="https://es.wikipedia.org/wiki/Virus_inform%C3%A1tico" title="Virus inform&aacute;tico">virus inform&aacute;tico</a>&nbsp;</p>
<p><a href="https://pcmanager.microsoft.com/es-es"target="_blank">como hacer un chequeo con windows </a></p>
<p><a href="https://www.adslzone.net/listas/mejores-webs/antivirus-online-gratis-detectar-eliminar-virus-archivos/"target="_blank">a qui  podra encontrar antivirus online </a></p>
<hr />
<a name="1"></a>
<h1 align="center"><p align="center">VACUNAS</p>
</h1>
<h1 align="left">
  <p align="left">&nbsp;</p>
</h1>
<p>SEGURIDAD INFORMATICA</p>
<p>Para el caso de que el virus haya bloqueado la mayor&iacute;a de funciones del ordenador y no pueda descargarse ni ejecutarse la vacuna, existen memorias USB que se pueden adquirir en las tiendas y que permiten introducirla de manera f&iacute;sica.</p>
<p>La seguridad de nuestros equipos y de la informaci&oacute;n es sumamente importante.<br />
  En las p&aacute;ginas recomendadas van a encontrar informaci&oacute;n y aplicaciones para<br />
  ayudarle a tomar medidas contra estos programas da&ntilde;inos.</p>
<p>PAGINA RECOMENDADAS<br />
  <a href="https://www.infospyware.com/"target="_blank">antispyware</a></p>
<p align="center"><img src="deposi.jpg" width="589" height="456" /></p>
  <p align="left"><a href="https://softwarelab.org/es/que-es-antimalware/"target="_blank">antimalware</a>
</p>
  </p>
  <p>  <a href="https://www.malware.es/"target="_blank">malware</a>
</p>
</p>
<p>VACUNAS ANTI VIRUS</p>
<p>Kaspersky Virus Removal Tool</p>
<p>Cure it</p>
<p>Norton Power Erase</p>
<p>Herramienta de eliminaci&oacute;n de software maligno</p>
<p>&nbsp;</p>
<p>VACUNAS ANTI ESPIAS Y MALWARE</p>
<p>Adwcleaner</p>
<p>malwarebytes</p>
<hr />
<H1>
  <a name="4"></a><p align="center">ANTIMALWARE</p>
</H1>
<H1 align="left">
  <p align="left"><font size="+2">QUE SON LOS ANTIMALWARE </font></p>
</H1>
<p data-sourcepos="1:1-1:328"><br />
  Los antimalware son un tipo de software dise&ntilde;ado para detectar, prevenir y eliminar software malicioso, tambi&eacute;n conocido como malware. El malware es un software que tiene como objetivo da&ntilde;ar un dispositivo o sistema inform&aacute;tico, y puede causar una variedad de problemas, como p&eacute;rdida de datos, robo de identidad o da&ntilde;os f&iacute;sicos.</p>
<p data-sourcepos="3:1-3:95">Los antimalware utilizan una variedad de t&eacute;cnicas para detectar y eliminar malware, incluyendo:</p>
<ul data-sourcepos="5:1-8:0">
  <li data-sourcepos="5:1-5:274"><strong>Firmas digitales:</strong>&nbsp;El antimalware puede comparar los archivos en un dispositivo con una base de datos de firmas digitales de malware conocido. Si se encuentra una coincidencia, el antimalware puede eliminar el archivo o tomar otras medidas para proteger el dispositivo.</li>
  <li data-sourcepos="6:1-6:206"><strong>An&aacute;lisis heur&iacute;stico:</strong>&nbsp;El antimalware tambi&eacute;n puede usar an&aacute;lisis heur&iacute;stico para detectar malware. El an&aacute;lisis heur&iacute;stico implica buscar comportamientos o caracter&iacute;sticas que son comunes en el malware.</li>
  <li data-sourcepos="7:1-8:0"><strong>Intelligent Threat Protection (ITP):</strong>&nbsp;ITP es una nueva tecnolog&iacute;a que utiliza aprendizaje autom&aacute;tico para detectar malware. ITP puede identificar malware que es nuevo o que ha sido modificado para evadir las t&eacute;cnicas tradicionales de detecci&oacute;n.</li>
</ul>
<p data-sourcepos="9:1-9:209">Los antimalware son una parte esencial de la seguridad inform&aacute;tica. Al utilizar un antimalware actualizado y de buena reputaci&oacute;n, puede ayudar a proteger su dispositivo de malware y mantener sus datos seguros.</p>
<p data-sourcepos="9:1-9:209"><strong>Tipos de antimalware</strong></p>
<p data-sourcepos="13:1-13:89">Los antimalware se pueden dividir en dos categor&iacute;as principales: antivirus y antispyware.</p>
<ul data-sourcepos="15:1-17:0">
  <li data-sourcepos="15:1-15:188"><strong>Antivirus:</strong>&nbsp;Los antivirus se centran en la detecci&oacute;n y eliminaci&oacute;n de virus inform&aacute;ticos, que son un tipo de malware que se replica a s&iacute; mismo y puede propagarse a otros dispositivos.</li>
  <li data-sourcepos="16:1-17:0"><strong>Antispyware:</strong>&nbsp;Los antispyware se centran en la detecci&oacute;n y eliminaci&oacute;n de software esp&iacute;a, que es un tipo de malware que recopila informaci&oacute;n sobre los usuarios sin su conocimiento.</li>
</ul>
<p>&nbsp;</p>
<p align="center"><img src="PNG.png" width="700" height="394" /></p>
<p data-sourcepos="18:1-18:23"><strong>Mejores antimalware</strong></p>
<p data-sourcepos="20:1-20:102">Hay muchos antimalware disponibles en el mercado. Algunos de los mejores antimalware de 2023 incluyen:</p>
<ul data-sourcepos="22:1-27:0">
  <li data-sourcepos="22:1-22:157"><strong>Malwarebytes:</strong>&nbsp;Malwarebytes es un antimalware eficaz que ofrece una amplia gama de funciones, incluyendo protecci&oacute;n contra malware, ransomware y adware.</li>
  <li data-sourcepos="23:1-23:139"><strong>Norton 360:</strong>&nbsp;Norton 360 es un paquete de seguridad completo que incluye un antivirus, un firewall, una VPN y un gestor de contrase&ntilde;as.</li>
  <li data-sourcepos="24:1-24:129"><strong>Bitdefender Total Security:</strong>&nbsp;Bitdefender Total Security es un antimalware potente con una alta tasa de detecci&oacute;n de malware.</li>
  <li data-sourcepos="25:1-25:108"><strong>AVG ULTIMATE:</strong>&nbsp;AVG ULTIMATE es un antimalware asequible que ofrece una buena protecci&oacute;n contra malware.</li>
  <li data-sourcepos="26:1-27:0"><strong>Kaspersky Total Security:</strong>&nbsp;Kaspersky Total Security es un antimalware avanzado con una amplia gama de funciones.</li>
</ul>
<p data-sourcepos="28:1-28:30"><strong>C&oacute;mo elegir un antimalware</strong></p>
<p data-sourcepos="30:1-30:75">Al elegir un antimalware, es importante considerar los siguientes factores:</p>
<ul data-sourcepos="32:1-35:0">
  <li data-sourcepos="32:1-32:106"><strong>Protecci&oacute;n:</strong>&nbsp;El antimalware debe proporcionar una buena protecci&oacute;n contra una amplia gama de malware.</li>
  <li data-sourcepos="33:1-33:73"><strong>Facilidad de uso:</strong>&nbsp;El antimalware debe ser f&aacute;cil de instalar y usar.</li>
  <li data-sourcepos="34:1-35:0"><strong>Costo:</strong>&nbsp;El antimalware debe ser asequible.</li>
</ul>
<p data-sourcepos="36:1-36:41"><strong>Consejos para utilizar un antimalware</strong></p>
<p data-sourcepos="38:1-38:72">Para obtener el m&aacute;ximo beneficio de un antimalware, siga estos consejos:</p>
<ul data-sourcepos="40:1-44:0">
  <li data-sourcepos="40:1-40:173"><strong>Mantenga su antimalware actualizado:</strong>&nbsp;Los desarrolladores de antimalware lanzan actualizaciones frecuentes para agregar nuevas firmas digitales y mejorar la protecci&oacute;n.</li>
  <li data-sourcepos="41:1-41:138"><strong>Realice an&aacute;lisis regulares:</strong>&nbsp;Los an&aacute;lisis regulares pueden ayudar a detectar malware que a&uacute;n no ha sido detectado por el antimalware.</li>
  <li data-sourcepos="42:1-42:98"><strong>Utilice un firewall:</strong>&nbsp;Un firewall puede ayudar a proteger su dispositivo de ataques externos.</li>
  <li data-sourcepos="43:1-44:0"><strong>Sea cuidadoso con lo que descarga:</strong>&nbsp;Evite descargar archivos de fuentes desconocidas.</li>
</ul>
<p data-sourcepos="45:1-45:105">Al seguir estos consejos, puede ayudar a proteger su dispositivo de malware y mantener sus datos seguros.</p>
<hr />
<H1>
  <a name="5"></a><p align="center">ANTISPYWARE Y SOFWARE DA&Ntilde;INO </p>
</H1>
<p data-sourcepos="1:1-1:81"><br />
  El antispyware y el software son dos t&eacute;rminos relacionados, pero no son lo mismo.</p>
<p data-sourcepos="3:1-3:328">El antispyware es un tipo de software que se utiliza para detectar, prevenir y eliminar el software esp&iacute;a. El software esp&iacute;a es un tipo de malware que recopila informaci&oacute;n sobre los usuarios sin su conocimiento. Esta informaci&oacute;n puede incluir contrase&ntilde;as, n&uacute;meros de tarjetas de cr&eacute;dito y otra informaci&oacute;n personal confidencial.</p>
<p data-sourcepos="5:1-5:211">El software es un t&eacute;rmino general que se refiere a cualquier programa de computadora. El software puede utilizarse para una variedad de prop&oacute;sitos, incluyendo la productividad, el entretenimiento y la educaci&oacute;n.</p>
<p data-sourcepos="7:1-7:216">El antispyware es una parte importante de la seguridad inform&aacute;tica. Al utilizar un antispyware actualizado y de buena reputaci&oacute;n, puede ayudar a proteger su dispositivo de software esp&iacute;a y mantener sus datos seguros.</p>
<p data-sourcepos="9:1-9:50">Algunos ejemplos de software antispyware incluyen:</p>
<ul data-sourcepos="11:1-16:0">
  <li data-sourcepos="11:1-11:27">Malwarebytes Anti-Malware</li>
  <li data-sourcepos="12:1-12:12">AdwCleaner</li>
  <li data-sourcepos="13:1-13:11">SpyHunter</li>
  <li data-sourcepos="14:1-14:11">HitmanPro</li>
  <li data-sourcepos="15:1-16:0">SUPERAntiSpyware</li>
</ul>
<p data-sourcepos="17:1-17:218">Puede descargar e instalar software antispyware de forma gratuita o comprar una versi&oacute;n comercial. Las versiones comerciales suelen ofrecer caracter&iacute;sticas adicionales, como protecci&oacute;n en tiempo real y soporte t&eacute;cnico.</p>
<p data-sourcepos="19:1-19:248">Es importante tener en cuenta que el antispyware no es un sustituto de un antivirus. Un antivirus protege su dispositivo de virus, que son otro tipo de malware. Para obtener la mejor protecci&oacute;n, debe utilizar tanto un antivirus como un antispyware.</p>
<p align="center" data-sourcepos="19:1-19:248"><img src="deposi.jpg" width="623" height="473" /></p>
<p data-sourcepos="1:1-1:67">Los antispyware se pueden clasificar en dos categor&iacute;as principales:</p>
<ul data-sourcepos="3:1-5:0">
  <li data-sourcepos="3:1-3:353"><strong>Antispyware basado en firmas:</strong>&nbsp;Este tipo de antispyware utiliza una base de datos de firmas digitales de software esp&iacute;a conocido. Cuando el antispyware escanea un archivo, compara el archivo con la base de datos de firmas. Si encuentra una coincidencia, el antispyware identifica el archivo como software esp&iacute;a y lo elimina o lo pone en cuarentena.</li>
  <li data-sourcepos="4:1-5:0"><strong>Antispyware basado en comportamiento:</strong>&nbsp;Este tipo de antispyware busca comportamientos o caracter&iacute;sticas que son comunes en el software esp&iacute;a. Por ejemplo, el antispyware puede buscar programas que acceden a informaci&oacute;n personal confidencial, como contrase&ntilde;as o n&uacute;meros de tarjetas de cr&eacute;dito.</li>
</ul>
<p data-sourcepos="6:1-6:89">Adem&aacute;s de estas dos categor&iacute;as principales, tambi&eacute;n hay otros tipos de antispyware, como:</p>
<ul data-sourcepos="8:1-11:0">
  <li data-sourcepos="8:1-8:135"><strong>Antispyware web:</strong>&nbsp;Este tipo de antispyware se centra en la protecci&oacute;n contra software esp&iacute;a que se propaga a trav&eacute;s de sitios web.</li>
  <li data-sourcepos="9:1-9:143"><strong>Antispyware m&oacute;vil:</strong>&nbsp;Este tipo de antispyware est&aacute; dise&ntilde;ado para proteger los dispositivos m&oacute;viles, como tel&eacute;fonos inteligentes y tabletas.</li>
  <li data-sourcepos="10:1-11:0"><strong>Antispyware empresarial:</strong>&nbsp;Este tipo de antispyware est&aacute; dise&ntilde;ado para proteger las redes empresariales.</li>
</ul>
<p data-sourcepos="12:1-12:30"><strong>C&oacute;mo elegir un antispyware</strong></p>
<p data-sourcepos="14:1-14:75">Al elegir un antispyware, es importante considerar los siguientes factores:</p>
<ul data-sourcepos="16:1-19:0">
  <li data-sourcepos="16:1-16:113"><strong>Protecci&oacute;n:</strong>&nbsp;El antispyware debe proporcionar una buena protecci&oacute;n contra una amplia gama de software esp&iacute;a.</li>
  <li data-sourcepos="17:1-17:73"><strong>Facilidad de uso:</strong>&nbsp;El antispyware debe ser f&aacute;cil de instalar y usar.</li>
  <li data-sourcepos="18:1-19:0"><strong>Costo:</strong>&nbsp;El antispyware debe ser asequible.</li>
</ul>
<p data-sourcepos="20:1-20:41"><strong>Consejos para utilizar un antispyware</strong></p>
<p data-sourcepos="22:1-22:72">Para obtener el m&aacute;ximo beneficio de un antispyware, siga estos consejos:</p>
<ul data-sourcepos="24:1-28:0">
  <li data-sourcepos="24:1-24:173"><strong>Mantenga su antispyware actualizado:</strong>&nbsp;Los desarrolladores de antispyware lanzan actualizaciones frecuentes para agregar nuevas firmas digitales y mejorar la protecci&oacute;n.</li>
  <li data-sourcepos="25:1-25:145"><strong>Realice an&aacute;lisis regulares:</strong>&nbsp;Los an&aacute;lisis regulares pueden ayudar a detectar software esp&iacute;a que a&uacute;n no ha sido detectado por el antispyware.</li>
  <li data-sourcepos="26:1-26:98"><strong>Utilice un firewall:</strong>&nbsp;Un firewall puede ayudar a proteger su dispositivo de ataques externos.</li>
  <li data-sourcepos="27:1-28:0"><strong>Sea cuidadoso con lo que descarga:</strong>&nbsp;Evite descargar archivos de fuentes desconocidas.</li>
</ul>
<p data-sourcepos="29:1-29:112">Al seguir estos consejos, puede ayudar a proteger su dispositivo de software esp&iacute;a y mantener sus datos seguros.</p>
<p data-sourcepos="31:1-31:35"><strong>Algunos ejemplos de antispyware</strong></p>
<p data-sourcepos="33:1-33:50">Algunos de los antispyware m&aacute;s populares incluyen:</p>
<ul data-sourcepos="35:1-39:117">
  <li data-sourcepos="35:1-35:177"><strong>Malwarebytes Anti-Malware:</strong>&nbsp;Malwarebytes es un antispyware eficaz que ofrece una amplia gama de funciones, incluyendo protecci&oacute;n contra software esp&iacute;a, ransomware y adware.</li>
  <li data-sourcepos="36:1-36:139"><strong>Norton 360:</strong>&nbsp;Norton 360 es un paquete de seguridad completo que incluye un antivirus, un firewall, una VPN y un gestor de contrase&ntilde;as.</li>
  <li data-sourcepos="37:1-37:129"><strong>Bitdefender Total Security:</strong>&nbsp;Bitdefender Total Security es un antispyware potente con una alta tasa de detecci&oacute;n de malware.</li>
  <li data-sourcepos="38:1-38:108"><strong>AVG ULTIMATE:</strong>&nbsp;AVG ULTIMATE es un antispyware asequible que ofrece una buena protecci&oacute;n contra malware.</li>
  <li data-sourcepos="39:1-39:117"><strong>Kaspersky Total Security:</strong>&nbsp;Kaspersky Total Security es un antispyware avanzado con una amplia gama de funciones.</li>
</ul>
<hr />
<div align="center">
 <a name="7"></a> <p align="center" data-sourcepos="1:1-1:312">RANSONWARE</p>
  <p align="left" data-sourcepos="1:1-1:312">&nbsp;</p>
  <p align="left" data-sourcepos="1:1-1:312">El ransomware es un tipo de malware que restringe el acceso a los datos o al sistema operativo de una computadora, a cambio de un rescate. El ransomware suele cifrar los archivos de la v&iacute;ctima, lo que hace que sean inaccesibles. Para recuperar el acceso a sus datos, la v&iacute;ctima debe pagar un rescate al atacante.</p>
  <p align="left" data-sourcepos="3:1-3:193">El ransomware se ha convertido en una de las formas m&aacute;s graves de malware en los &uacute;ltimos a&ntilde;os. Los ataques de ransomware han afectado a empresas, organizaciones y particulares de todo el mundo.</p>
  <p align="left" data-sourcepos="5:1-5:31"><strong>C&oacute;mo funciona el ransomware</strong></p>
  <p align="center" data-sourcepos="5:1-5:31"><img src="ransomware.jpg" width="710" height="400" /></p>
  <p align="left" data-sourcepos="7:1-7:316">El ransomware suele propagarse a trav&eacute;s de correos electr&oacute;nicos de phishing, enlaces maliciosos o archivos adjuntos. Una vez que el ransomware se ejecuta en un sistema, comienza a cifrar los archivos. El ransomware suele utilizar un algoritmo de cifrado fuerte que es dif&iacute;cil de descifrar sin la clave de descifrado.</p>
  <p align="left" data-sourcepos="9:1-9:279">Una vez que los archivos est&aacute;n cifrados, el ransomware muestra un mensaje de rescate. El mensaje de rescate suele exigir un pago en criptomonedas, como Bitcoin o Ethereum. El atacante afirma que, si la v&iacute;ctima no paga el rescate, los datos ser&aacute;n eliminados o publicados en l&iacute;nea.</p>
  <p align="left" data-sourcepos="11:1-11:34"><strong>C&oacute;mo protegerse del ransomware</strong></p>
  <p align="left" data-sourcepos="13:1-13:82">Hay una serie de cosas que puede hacer para protegerse del ransomware, incluyendo:</p>
  <div align="left">
    <ul data-sourcepos="15:1-20:0">
      <li data-sourcepos="15:1-15:93"><strong>Instale y mantenga actualizado un software antivirus y antimalware de buena reputaci&oacute;n.</strong></li>
      <li data-sourcepos="16:1-16:71"><strong>Sea cuidadoso con lo que descarga o abre de fuentes desconocidas.</strong></li>
      <li data-sourcepos="17:1-17:76"><strong>No abra correos electr&oacute;nicos de remitentes desconocidos o sospechosos.</strong></li>
      <li data-sourcepos="18:1-18:67"><strong>Mantenga sus sistemas operativos y aplicaciones actualizados.</strong></li>
      <li data-sourcepos="19:1-20:0"><strong>Cree copias de seguridad de sus datos con regularidad.</strong></li>
    </ul>
  </div>
  <p align="left" data-sourcepos="21:1-21:57"><strong>Consejos para recuperar datos cifrados por ransomware</strong></p>
  <p align="left" data-sourcepos="23:1-23:120">Si sus datos han sido cifrados por ransomware, hay algunas cosas que puede hacer para intentar recuperarlos, incluyendo:</p>
  <div align="left">
    <ul data-sourcepos="25:1-28:0">
      <li data-sourcepos="25:1-25:191"><strong>Intente utilizar una herramienta de descifrado gratuita o de pago.</strong>&nbsp;Hay una serie de herramientas de descifrado disponibles en l&iacute;nea, algunas de las cuales son gratuitas y otras de pago.</li>
      <li data-sourcepos="26:1-26:157"><strong>Restaure sus datos desde una copia de seguridad.</strong>&nbsp;Si tiene una copia de seguridad reciente de sus datos, puede restaurarlos desde la copia de seguridad.</li>
      <li data-sourcepos="27:1-28:0"><strong>Contacte con un profesional de la recuperaci&oacute;n de datos.</strong>&nbsp;Un profesional de la recuperaci&oacute;n de datos puede intentar recuperar sus datos si no puede hacerlo usted mismo.</li>
    </ul>
  </div>
  <p align="left" data-sourcepos="29:1-29:119">Es importante tener en cuenta que no hay garant&iacute;a de que pueda recuperar sus datos si han sido cifrados por ransomware.</p>
  <p>&nbsp;</p>
  <p data-sourcepos="1:1-1:312">&nbsp;</p>
</div>
</body>
</html>
